# LDevice_ResetVisual

## Description
Cleans up the visual/drawing cache for the specified lighting device object.

```pascal
PROCEDURE LDevice_ResetVisual(h : HANDLE);
```

```python

def vs.LDevice_ResetVisual(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||

## Version
Availability: from Vectorworks 2015
## Category
* Spotlight